---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.TextNotImported
source: html/c03d7029-6539-e072-126c-78b46c0fe580.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.TextNotImported Property

Text is only imported if the "Current View Only" option is selected. To see the text in the original file, import again with this check box selected in the Import Dialog.

## Syntax (C#)
```csharp
public static FailureDefinitionId TextNotImported { get; }
```